[
  {
    "Key": "Intro1",
    "Title": "Crow?",
    "Body": "The crow-like... creature... gets up off the ground with a triumphant look in its beady eyes, dusting itself off, and then straightening its ruffled feathers.",
    "Buttons": [
      {
        "Key": "Intro2",
        "Text": "Continue"
      }
    ]
  },
  {
    "Key": "Intro2",
    "Title": "Crow?",
    "Body": "\"There you are! I've jumped through seventeen different axons and half the entire Capricorn Tropic trying to find you!\"",
    "Buttons": [
      {
        "Key": "Intro3",
        "Text": "Continue"
      }
    ]
  },
  {
    "Key": "Intro3",
    "Title": "Alican",
    "Body": "\"Yes, yes, my name is Alican, and I believe we can help each other. You see, I am a Seeker. Of what, exactly, is not free information, but I'll give you a hint.\"",
    "Buttons": [
      {
        "Key": "Intro4",
        "Text": "Continue"
      }
    ]
  },
  {
    "Key": "Intro4",
    "Title": "Alican",
    "Body": "Alican leans towards you, with its voice reduced to a whisper and a manic glint in its eye.",
    "Buttons": [
      {
        "Key": "Intro5",
        "Text": "Continue"
      }
    ]
  },
  {
    "Key": "Intro5",
    "Title": "Alican",
    "Body": "\"Mana's not the only thing out there. It's an engine of change, it can blow things up, it can reverse entropy, but it's not all there is. I'm studying *Starlight*. The inverse of mana... the energy of meaning, of memory, of connection. If you let me observe your efforts, I'll teach you how to use it.\"",
    "Buttons": [
      {
        "Key": "Intro6",
        "Text": "Continue"
      }
    ]
  },
  {
    "Key": "Intro6",
    "Title": "Alican",
    "Body": "\"This is Starsight. The ability to glimpse the weave of fate and meaning, grasping onto but a thin thread. If you encounter something beyond your own understanding, use it to borrow the knowledge you need. I have a feeling you'll be generating a lot of useful data for me...\"",
    "Buttons": [
      {
        "Key": "Intro7",
        "Code": "UnlockStarsight",
        "Text": "Accept"
      }
    ]
  },
  {
    "Key": "Intro7",
    "Title": "Alican",
    "Body": "\"I've got business in the Equatorial Ring, but before I go, one last word of advice... Something lurks beneath the nearby desert. The threads of memory converge in a great tangle - if you wish to understand Starlight, you must confront and decipher whatever's waiting for you there. I'll be watching.\"",
    "Buttons": [
      {
        "Key": "End",
        "Code": "StarsightTutorial",
        "Text": "Bye?"
      }
    ]
  }
]